# Statistics Challenge (Optional)

Use the `orders.csv` dataset in the same directory to complete this challenge.

**Background**:

There are exactly 100 sneaker shops on a sneaker retailing website, and each of these shops sells only one model of shoe. We want to do some analysis of the average order value (AOV). When we look at orders data over a 30 day window, we naively calculate an AOV of $3145.13. Given that we know these shops are selling sneakers, a relatively affordable item, something seems wrong with our analysis. 

**Questions**:

- What went wrong with this metric (AOV) and the current analysis in general. Support your answers with appropriate visualizations.

- Propose a new metric that better represents the behavior of the stores' customers. Why are these metrics better and what are their values?

- Using the `created_at` column as a proxy for the date and time of order creation, provide a brief analysis of the trends in the customers' purchasing behavior.

Show all of your work in this notebook.

In [46]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [26]:
df = pd.read_csv('/Users/lixinjin/Downloads/MDST-Tutorial-main/Optional Challenges/Statistics Focus/orders.csv')
df.head()

In [24]:
df.sort_values('created_at') # Here we get a basic knowledge about 'created_at', range from 2017-03-01 to 2017-03-30

,order_id,shop_id,user_id,order_value,total_items,payment_method,created_at
1862,1863,39,738,536,4,cash,2017-03-01 0:08:09
1741,1742,39,910,268,2,cash,2017-03-01 0:10:19
3228,3229,97,912,324,2,cash,2017-03-01 0:14:12
1267,1268,80,798,290,2,credit_card,2017-03-01 0:19:31
2689,2690,49,799,258,2,credit_card,2017-03-01 0:22:25
...,...,...,...,...,...,...,...
2765,2766,9,708,236,2,debit,2017-03-30 9:22:41
4890,4891,63,853,136,1,cash,2017-03-30 9:27:00
244,245,32,928,202,2,cash,2017-03-30 9:30:28
211,212,22,712,292,2,credit_card,2017-03-30 9:40:40
145,146,72,906,640,4,cash,2017-03-30 9:55:00

In [41]:
df.describe()

          order_id      shop_id      user_id    order_value  total_items
count  5000.000000  5000.000000  5000.000000    5000.000000   5000.00000
mean   2500.500000    50.078800   849.092400    3145.128000      8.78720
std    1443.520003    29.006118    87.798982   41282.539349    116.32032
min       1.000000     1.000000   607.000000      90.000000      1.00000
25%    1250.750000    24.000000   775.000000     163.000000      1.00000
50%    2500.500000    50.000000   849.000000     284.000000      2.00000
75%    3750.250000    75.000000   925.000000     390.000000      3.00000
max    5000.000000   100.000000   999.000000  704000.000000   2000.00000

### Question 1

In [30]:
df['order_value'].mean()

3145.128

The problem with AOV is they caculate the mean value of all 100 shops order_value column over 30 days. This will give $3145.13 value.

### Question 2

In [42]:
# plt.hist(df['order_value'], color='blue', edgecolor='black', bins=100)

Based on the hist plot and dataframe describe() result, order_value column is highly skewed to right, because most of the transactions are a few hundred dollars; however, there are some transactions with very large amounts, such as the maximum $704,000. This skewness largely affects the mean value or order_value. Therefore, we prefer median order value to represent behavior of stores' customers. We can simply compute the median order value, and also compute median based on number of items.

In [43]:
# Median for all transcation in March
df['order_value'].median()

284.0

In [62]:
order_num = df.groupby(['total_items'])['order_id'].nunique().to_frame()
order_num = order_num.reset_index()
order_num = order_num.rename({'total_items':'count'})
order_num

#sns.barplot(data = order_num, x='total_items', y='count')

   total_items  order_id
0            1      1830
1            2      1832
2            3       941
3            4       293
4            5        77
5            6         9
6            8         1
7         2000        17

In [45]:
df['order_value_per_item'] = df['order_value'] / df['total_items']
df['order_value_per_item'].median()

153.0

The median order value across all transactions is $284, which is based on every transaction. Furthermore, the median order value per item is $153, making it useful to know the value of each item in an order. A median value is not affected by outliers and is a reliable indicator of customer behavior.